Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.ReinforcementStrandAttributes.ReinforcementVisibility Property
 Defines which bars in the group appear in drawings.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementBase.ReinforcementVisibilityTypes ReinforcementVisibility { get; set; }
Public Property ReinforcementVisibility As ReinforcementBase.ReinforcementVisibilityTypes
	Get
	Set
Property Value
Type: ReinforcementBase.ReinforcementVisibilityTypes
See Also
Reference
ReinforcementBase.ReinforcementStrandAttributes Class
Tekla.Structures.Drawing Namespace